TexasInstruments/mcupsdk-core/examples/empty/am261x-lp/r5fss0-1_freertos/iar-arm/example.syscfg
/**
 * These arguments were used when this file was generated. They will be automatically applied on subsequent loads
 * via the GUI or CLI. Run CLI with '--help' for additional information on how to override these arguments.
 * @cliArgs --device "AM261x_ZFG" --part "AM2612" --package "ZFG" --context "r5fss0-1" --product "MCU_PLUS_SDK@07.03.01"
 * @v2CliArgs --device "AM2612" --package "NFBGA (ZFG)" --variant "500MHz" --context "r5fss0-1" --product "MCU_PLUS_SDK@07.03.01"
 * @versions {"tool":"1.26.0+4407"}
 */

/**
 * Import the modules used in this configuration.
 */
const debug_log       = scripting.addModule("/kernel/dpl/debug_log");
const dpl_cfg         = scripting.addModule("/kernel/dpl/dpl_cfg");
const mpu_armv7       = scripting.addModule("/kernel/dpl/mpu_armv7", {}, false);
const mpu_armv71      = mpu_armv7.addInstance();
const mpu_armv72      = mpu_armv7.addInstance();
const mpu_armv73      = mpu_armv7.addInstance();
const mpu_armv74      = mpu_armv7.addInstance();
const mpu_armv75      = mpu_armv7.addInstance();
const mpu_armv76      = mpu_armv7.addInstance();
const default_linker  = scripting.addModule("/memory_configurator/default_linker", {}, false);
const default_linker1 = default_linker.addInstance();
const general         = scripting.addModule("/memory_configurator/general", {}, false);
const general1        = general.addInstance();
const region          = scripting.addModule("/memory_configurator/region", {}, false);
const region1         = region.addInstance();
const section         = scripting.addModule("/memory_configurator/section", {}, false);
const section1        = section.addInstance();
const section2        = section.addInstance();
const section3        = section.addInstance();
const section4        = section.addInstance();
const section5        = section.addInstance();
const section6        = section.addInstance();
const section7        = section.addInstance();
const section8        = section.addInstance();
const section9        = section.addInstance();
const section10       = section.addInstance();
const section11       = section.addInstance();

/**
 * Write custom configuration values to the imported modules.
 */
debug_log.enableSharedMemLog = true;

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

mpu_armv75.$name        = "CONFIG_MPU_REGION4";
mpu_armv75.size         = 14;
mpu_armv75.baseAddr     = 0x50D00000;
mpu_armv75.allowExecute = false;
mpu_armv75.attributes   = "Device";

mpu_armv76.$name        = "CONFIG_MPU_REGION5";
mpu_armv76.size         = 14;
mpu_armv76.allowExecute = false;
mpu_armv76.attributes   = "NonCached";
mpu_armv76.baseAddr     = 0x72000000;

default_linker1.$name    = "memory_configurator_default_linker0";
default_linker1.compiler = "iar-arm";

general1.$name           = "CONFIG_GENERAL0";
general1.choose_compiler = "iar-arm";
general1.linker.$name    = "IARARM0";

region1.$name                               = "MEMORY_REGION_CONFIGURATION0";
region1.memory_region.create(5);
region1.memory_region[0].type               = "TCMA";
region1.memory_region[0].$name              = "R5F_VECS";
region1.memory_region[0].auto               = false;
region1.memory_region[0].size               = 0x40;
region1.memory_region[1].type               = "TCMA";
region1.memory_region[1].$name              = "R5F_TCMA";
region1.memory_region[1].size               = 0x7FC0;
region1.memory_region[2].type               = "TCMB";
region1.memory_region[2].size               = 0x8000;
region1.memory_region[2].$name              = "R5F_TCMB";
region1.memory_region[3].$name              = "OCRAM";
region1.memory_region[3].auto               = false;
region1.memory_region[3].manualStartAddress = 0x70080000;
region1.memory_region[3].size               = 0x40000;
region1.memory_region[4].type               = "FLASH";
region1.memory_region[4].auto               = false;
region1.memory_region[4].manualStartAddress = 0x60180000;
region1.memory_region[4].size               = 0x80000;
region1.memory_region[4].$name              = "FLASH";

section1.load_memory                  = "R5F_VECS";
section1.group                        = false;
section1.$name                        = "Vector Table";
section1.place_at_start               = true;
section1.output_section.create(1);
section1.output_section[0].palignment = true;
section1.output_section[0].$name      = ".intvec";

section2.load_memory                  = "OCRAM";
section2.$name                        = "Text Segments";
section2.output_section.create(6);
section2.output_section[0].$name      = ".text.hwi";
section2.output_section[0].palignment = true;
section2.output_section[1].$name      = ".text.cache";
section2.output_section[1].palignment = true;
section2.output_section[2].$name      = ".text.mpu";
section2.output_section[2].palignment = true;
section2.output_section[3].$name      = ".text.boot";
section2.output_section[3].palignment = true;
section2.output_section[4].$name      = ".text:abort";
section2.output_section[4].palignment = true;
section2.output_section[5].$name      = ".text.pmu";

section3.load_memory                  = "OCRAM";
section3.$name                        = "Code and Read-Only Data";
section3.output_section.create(4);
section3.output_section[0].$name      = ".text";
section3.output_section[0].palignment = true;
section3.output_section[1].$name      = ".rodata";
section3.output_section[1].palignment = true;
section3.output_section[2].$name      = ".rodata.cfg";
section3.output_section[3].$name      = ".iar.init_table";

section4.load_memory                  = "OCRAM";
section4.$name                        = "Data & BSS Segment";
section4.output_section.create(3);
section4.output_section[0].$name      = ".data";
section4.output_section[0].palignment = true;
section4.output_section[1].$name      = ".data.pmu";
section4.output_section[2].$name      = ".bss";

section5.load_memory = "OCRAM";
section5.$name       = "Stack Segments";
section5.type        = "STACK";

section6.load_memory                  = "OCRAM";
section6.$name                        = "Initialization and Exception Handling";
section6.output_section.create(3);
section6.output_section[0].$name      = ".ARM.exidx";
section6.output_section[0].palignment = true;
section6.output_section[1].$name      = ".init_array";
section6.output_section[1].palignment = true;
section6.output_section[2].$name      = ".fini_array";
section6.output_section[2].palignment = true;

section7.load_memory                 = "USER_SHM_MEM";
section7.type                        = "NOLOAD";
section7.$name                       = "User Shared Memory";
section7.group                       = false;
section7.output_section.create(1);
section7.output_section[0].$name     = ".bss.user_shared_mem";
section7.output_section[0].alignment = 0;

section8.load_memory                 = "LOG_SHM_MEM";
section8.$name                       = "Log Shared Memory";
section8.group                       = false;
section8.type                        = "NOLOAD";
section8.output_section.create(1);
section8.output_section[0].$name     = ".bss.log_shared_mem";
section8.output_section[0].alignment = 0;

section9.load_memory                 = "RTOS_NORTOS_IPC_SHM_MEM";
section9.type                        = "NOLOAD";
section9.$name                       = "IPC Shared Memory";
section9.group                       = false;
section9.output_section.create(1);
section9.output_section[0].$name     = ".bss.ipc_vring_mem";
section9.output_section[0].alignment = 0;

section10.load_memory                 = "MAILBOX_HSM";
section10.type                        = "NOLOAD";
section10.$name                       = "SIPC HSM Queue Memory";
section10.group                       = false;
section10.output_section.create(1);
section10.output_section[0].$name     = ".bss.sipc_hsm_queue_mem";
section10.output_section[0].alignment = 0;

section11.load_memory                 = "MAILBOX_R5F";
section11.$name                       = "SIPC R5F Queue Memory";
section11.group                       = false;
section11.type                        = "NOLOAD";
section11.output_section.create(1);
section11.output_section[0].$name     = ".bss.sipc_secure_host_queue_mem";
section11.output_section[0].alignment = 0;
